Revit 2027 API
OrdinateDimensionSetting.TextOrientation Property
 Specifies where to align the dimension text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OrdinateTextOrientation TextOrientation { get; set; }
Public Property TextOrientation As OrdinateTextOrientation
	Get
	Set
public:
property OrdinateTextOrientation TextOrientation {
	OrdinateTextOrientation get ();
	void set (OrdinateTextOrientation value);
}
member TextOrientation : OrdinateTextOrientation with get, set
Property Value
OrdinateTextOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace